benchmarks/standingCapillaryWave/sinWave/system/ijkDict
{
cellSet domain;
cyclicX true;
}